


class MainStyleText:
    @classmethod
    def subscribe_channel(cls,channel_url):
        return (
        "❗ <b>Щоб користуватись ботом, потрібно підписатись на наш канал</b>\n\n"
        f"📢 <a href='{channel_url}'>Підписатись на канал</a>\n\n"
        "Після підписки натисни кнопку нижче 👇"
    )

    def start_message_no_steam_id(self,username):
        return (f"👋 <b>Привіт, радий тебе бачити, @{username}!</b>\n"
                f"🧠 <i>Я бот, який допоможе тобі відстежувати знижки, новинки та події у Steam 🎯</i>\n\n"
                f"🎮 <b>Щоб продовжити, надішли свій Steam профіль:</b>\n"
                f"• 🔢 SteamID64 (наприклад: <code>7656119...</code>)\n"
                f"• ✏️ Нік з URL (наприклад: <code>floysefake</code>)\n"
                f"• 🔗 Посилання на профіль (будь-якого типу)\n\n"
                f"<i>Ми автоматично все розпізнаємо 😉</i>")

    def start_message_with_steam_id(self, username):
        return (
            f"<b>Привіт, радий тебе знову бачити, @{username}!</b>\n\n"
            "🎮 Я — твій персональний помічник у світі Steam!\n"
            "🔍 Допоможу знайти ігри за знижками, популярністю чи жанром.\n"
            "📈 Стежу за змінами цін і повідомлю про вигідні пропозиції.\n"
            "🗓 Можу показувати актуальні події та фестивалі у Steam.\n\n"
            "✅ Ти вже отримав повний доступ до всіх можливостей бота.\n"
            "👇 Обери категорію, яка тебе цікавить, і погнали шукати ідеальну гру!"
        )